<a href="https://colab.research.google.com/github/Sanket2iconic/Capstone-Project/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1) build on the top of NumPy
2) High level data manupulation.

- Read
-write
-filter, sort, group, arrange
- merge, join
- Rehape( Pivoting and stacking)
- Handling missing dta and deal with the outliers
- time series analysis and data visualuzation.

### Serial:

- One dimentional array that stores data in column format
- index are given
- data type is given

In [1]:
import pandas as pd

In [9]:
#Series
a=[10,20,30,40]
aa=pd.Series(a)
aa

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
aa.index=['a','b','c','d']
aa

a    10
b    20
c    30
d    40
dtype: int64

### Data frames

- stored data in the form of rows and column( tabular formate)